In [1]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [2]:
# First, our dictionary

dico = {'X':[1,2,np.nan], 'Y':[4,np.nan,np.nan],'Z':[7,8,9]}
dico                                                                     # show

{'X': [1, 2, nan], 'Y': [4, nan, nan], 'Z': [7, 8, 9]}

In [3]:
# passing the dictionary to a dataframe
row_labels = 'A B C'.split()
df = pd.DataFrame(dico, row_labels)
df # show

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [5]:
# this removes 'nan' row-wise
df.dropna()

     X    Y  Z
A  1.0  4.0  7

In [6]:
# this removes 'nan' column-wise
df.dropna(axis=1)

   Z
A  7
B  8
C  9

In [7]:
# drop rows with less than 2 actual values
df.dropna(thresh=2)

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8

In [8]:
# Exercise

In [9]:
df.dropna(axis=1,thresh=2)

     X  Z
A  1.0  7
B  2.0  8
C  NaN  9

In [10]:
# filling up Nans

df.fillna('X')

     X    Y  Z
A  1.0  4.0  7
B  2.0    X  8
C    X    X  9

In [13]:
# Replacing missing values with mean in column 'X'
df['X'].fillna(value = df['X'].mean())
# df['X'].fillna(value = 0)

A    1.0
B    2.0
C    1.5
Name: X, dtype: float64

In [26]:
for i in 'X Y Z'.split():                             # loop
    df[i].fillna(value = df[i].mean(),inplace=True)
#     df[i].fillna(value = 10,inplace=True)
df                                                    # show

     X    Y  Z
A  1.0  4.0  7
B  2.0  4.0  8
C  1.5  4.0  9